{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "fastvit_t8", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "stem_1_REPARAM_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stem_1_REPARAM_1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_1_REPARAM_1_conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_1_REPARAM_1_conv", "inbound_nodes": [[["stem_1_REPARAM_1_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_1_REPARAM_2_conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_1_REPARAM_2_conv", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_1_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_1_REPARAM_1_bn", "inbound_nodes": [[["stem_1_REPARAM_1_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_1_REPARAM_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_1_REPARAM_2_bn", "inbound_nodes": [[["stem_1_REPARAM_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stem_1_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stem_1_REPARAM_out", "inbound_nodes": [[["stem_1_REPARAM_1_bn", 0, 0, {}], ["stem_1_REPARAM_2_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_1_outgelu", "trainable": true, "dtype": "float32", "activation": "gelu"}, "name": "stem_1_outgelu", "inbound_nodes": [[["stem_1_REPARAM_out", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stem_2_REPARAM_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stem_2_REPARAM_1_pad", "inbound_nodes": [[["stem_1_outgelu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stem_2_REPARAM_1_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stem_2_REPARAM_1_dw_conv", "inbound_nodes": [[["stem_2_REPARAM_1_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stem_2_REPARAM_2_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stem_2_REPARAM_2_dw_conv", "inbound_nodes": [[["stem_1_outgelu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_2_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_2_REPARAM_1_bn", "inbound_nodes": [[["stem_2_REPARAM_1_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_2_REPARAM_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_2_REPARAM_2_bn", "inbound_nodes": [[["stem_2_REPARAM_2_dw_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stem_2_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stem_2_REPARAM_out", "inbound_nodes": [[["stem_2_REPARAM_1_bn", 0, 0, {}], ["stem_2_REPARAM_2_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_2_outgelu", "trainable": true, "dtype": "float32", "activation": "gelu"}, "name": "stem_2_outgelu", "inbound_nodes": [[["stem_2_REPARAM_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_3_REPARAM_1_conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_3_REPARAM_1_conv", "inbound_nodes": [[["stem_2_outgelu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_3_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_3_REPARAM_1_bn", "inbound_nodes": [[["stem_3_REPARAM_1_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_3_REPARAM_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_3_REPARAM_0_bn", "inbound_nodes": [[["stem_2_outgelu", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stem_3_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stem_3_REPARAM_out", "inbound_nodes": [[["stem_3_REPARAM_1_bn", 0, 0, {}], ["stem_3_REPARAM_0_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_3_outgelu", "trainable": true, "dtype": "float32", "activation": "gelu"}, "name": "stem_3_outgelu", "inbound_nodes": [[["stem_3_REPARAM_out", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack1_block1_mixer_REPARAM_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack1_block1_mixer_REPARAM_1_pad", "inbound_nodes": [[["stem_3_outgelu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack1_block1_mixer_REPARAM_1_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack1_block1_mixer_REPARAM_1_dw_conv", "inbound_nodes": [[["stack1_block1_mixer_REPARAM_1_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack1_block1_mixer_REPARAM_2_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack1_block1_mixer_REPARAM_2_dw_conv", "inbound_nodes": [[["stem_3_outgelu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block1_mixer_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block1_mixer_REPARAM_1_bn", "inbound_nodes": [[["stack1_block1_mixer_REPARAM_1_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block1_mixer_REPARAM_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block1_mixer_REPARAM_2_bn", "inbound_nodes": [[["stack1_block1_mixer_REPARAM_2_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block1_mixer_REPARAM_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block1_mixer_REPARAM_0_bn", "inbound_nodes": [[["stem_3_outgelu", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack1_block1_mixer_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stack1_block1_mixer_REPARAM_out", "inbound_nodes": [[["stack1_block1_mixer_REPARAM_1_bn", 0, 0, {}], ["stack1_block1_mixer_REPARAM_2_bn", 0, 0, {}], ["stack1_block1_mixer_REPARAM_0_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block1_mixer_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block1_mixer_bn", "inbound_nodes": [[["stem_3_outgelu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract", "inbound_nodes": [["stack1_block1_mixer_REPARAM_out", 0, 0, {"y": ["stack1_block1_mixer_bn", 0, 0], "name": null}]]}, {"class_name": "resmlp>ChannelAffine", "config": {"name": "stack1_block1_1_gamma", "trainable": true, "dtype": "float32", "use_bias": false, "weight_init_value": 1e-05, "axis": -1}, "name": "stack1_block1_1_gamma", "inbound_nodes": [[["tf.math.subtract", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack1_block1_1_output", "trainable": true, "dtype": "float32"}, "name": "stack1_block1_1_output", "inbound_nodes": [[["stem_3_outgelu", 0, 0, {}], ["stack1_block1_1_gamma", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack1_block1_mlp_pre_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "stack1_block1_mlp_pre_pad", "inbound_nodes": [[["stack1_block1_1_output", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_block1_mlp_pre_conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 48, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_block1_mlp_pre_conv", "inbound_nodes": [[["stack1_block1_mlp_pre_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block1_mlp_pre_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block1_mlp_pre_bn", "inbound_nodes": [[["stack1_block1_mlp_pre_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_block1_mlp_Conv_0", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_block1_mlp_Conv_0", "inbound_nodes": [[["stack1_block1_mlp_pre_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack1_block1_mlp_gelu", "trainable": true, "dtype": "float32", "activation": "gelu"}, "name": "stack1_block1_mlp_gelu", "inbound_nodes": [[["stack1_block1_mlp_Conv_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_block1_mlp_Conv_1", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_block1_mlp_Conv_1", "inbound_nodes": [[["stack1_block1_mlp_gelu", 0, 0, {}]]]}, {"class_name": "resmlp>ChannelAffine", "config": {"name": "stack1_block1_2_gamma", "trainable": true, "dtype": "float32", "use_bias": false, "weight_init_value": 1e-05, "axis": -1}, "name": "stack1_block1_2_gamma", "inbound_nodes": [[["stack1_block1_mlp_Conv_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack1_block1_2_output", "trainable": true, "dtype": "float32"}, "name": "stack1_block1_2_output", "inbound_nodes": [[["stack1_block1_1_output", 0, 0, {}], ["stack1_block1_2_gamma", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack1_block2_mixer_REPARAM_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack1_block2_mixer_REPARAM_1_pad", "inbound_nodes": [[["stack1_block1_2_output", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack1_block2_mixer_REPARAM_1_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack1_block2_mixer_REPARAM_1_dw_conv", "inbound_nodes": [[["stack1_block2_mixer_REPARAM_1_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack1_block2_mixer_REPARAM_2_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack1_block2_mixer_REPARAM_2_dw_conv", "inbound_nodes": [[["stack1_block1_2_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block2_mixer_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block2_mixer_REPARAM_1_bn", "inbound_nodes": [[["stack1_block2_mixer_REPARAM_1_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block2_mixer_REPARAM_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block2_mixer_REPARAM_2_bn", "inbound_nodes": [[["stack1_block2_mixer_REPARAM_2_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block2_mixer_REPARAM_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block2_mixer_REPARAM_0_bn", "inbound_nodes": [[["stack1_block1_2_output", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack1_block2_mixer_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stack1_block2_mixer_REPARAM_out", "inbound_nodes": [[["stack1_block2_mixer_REPARAM_1_bn", 0, 0, {}], ["stack1_block2_mixer_REPARAM_2_bn", 0, 0, {}], ["stack1_block2_mixer_REPARAM_0_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block2_mixer_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block2_mixer_bn", "inbound_nodes": [[["stack1_block1_2_output", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_1", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_1", "inbound_nodes": [["stack1_block2_mixer_REPARAM_out", 0, 0, {"y": ["stack1_block2_mixer_bn", 0, 0], "name": null}]]}, {"class_name": "resmlp>ChannelAffine", "config": {"name": "stack1_block2_1_gamma", "trainable": true, "dtype": "float32", "use_bias": false, "weight_init_value": 1e-05, "axis": -1}, "name": "stack1_block2_1_gamma", "inbound_nodes": [[["tf.math.subtract_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack1_block2_1_output", "trainable": true, "dtype": "float32"}, "name": "stack1_block2_1_output", "inbound_nodes": [[["stack1_block1_2_output", 0, 0, {}], ["stack1_block2_1_gamma", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack1_block2_mlp_pre_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "stack1_block2_mlp_pre_pad", "inbound_nodes": [[["stack1_block2_1_output", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_block2_mlp_pre_conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 48, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_block2_mlp_pre_conv", "inbound_nodes": [[["stack1_block2_mlp_pre_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_block2_mlp_pre_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_block2_mlp_pre_bn", "inbound_nodes": [[["stack1_block2_mlp_pre_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_block2_mlp_Conv_0", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_block2_mlp_Conv_0", "inbound_nodes": [[["stack1_block2_mlp_pre_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack1_block2_mlp_gelu", "trainable": true, "dtype": "float32", "activation": "gelu"}, "name": "stack1_block2_mlp_gelu", "inbound_nodes": [[["stack1_block2_mlp_Conv_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_block2_mlp_Conv_1", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_block2_mlp_Conv_1", "inbound_nodes": [[["stack1_block2_mlp_gelu", 0, 0, {}]]]}, {"class_name": "resmlp>ChannelAffine", "config": {"name": "stack1_block2_2_gamma", "trainable": true, "dtype": "float32", "use_bias": false, "weight_init_value": 1e-05, "axis": -1}, "name": "stack1_block2_2_gamma", "inbound_nodes": [[["stack1_block2_mlp_Conv_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack1_block2_2_output", "trainable": true, "dtype": "float32"}, "name": "stack1_block2_2_output", "inbound_nodes": [[["stack1_block2_1_output", 0, 0, {}], ["stack1_block2_2_gamma", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_downsample_REPARAM_1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "stack2_downsample_REPARAM_1_pad", "inbound_nodes": [[["stack1_block2_2_output", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_downsample_REPARAM_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack2_downsample_REPARAM_2_pad", "inbound_nodes": [[["stack1_block2_2_output", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_downsample_REPARAM_1_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 48, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_downsample_REPARAM_1_conv", "inbound_nodes": [[["stack2_downsample_REPARAM_1_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_downsample_REPARAM_2_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 48, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_downsample_REPARAM_2_conv", "inbound_nodes": [[["stack2_downsample_REPARAM_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_downsample_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_downsample_REPARAM_1_bn", "inbound_nodes": [[["stack2_downsample_REPARAM_1_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_downsample_REPARAM_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_downsample_REPARAM_2_bn", "inbound_nodes": [[["stack2_downsample_REPARAM_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_downsample_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stack2_downsample_REPARAM_out", "inbound_nodes": [[["stack2_downsample_REPARAM_1_bn", 0, 0, {}], ["stack2_downsample_REPARAM_2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_downsample_2_REPARAM_1_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_downsample_2_REPARAM_1_conv", "inbound_nodes": [[["stack2_downsample_REPARAM_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_downsample_2_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_downsample_2_REPARAM_1_bn", "inbound_nodes": [[["stack2_downsample_2_REPARAM_1_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_downsample_2_REPARAM_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_downsample_2_REPARAM_0_bn", "inbound_nodes": [[["stack2_downsample_REPARAM_out", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_downsample_2_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stack2_downsample_2_REPARAM_out", "inbound_nodes": [[["stack2_downsample_2_REPARAM_1_bn", 0, 0, {}], ["stack2_downsample_2_REPARAM_0_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack2_downsample_2_outgelu", "trainable": true, "dtype": "float32", "activation": "gelu"}, "name": "stack2_downsample_2_outgelu", "inbound_nodes": [[["stack2_downsample_2_REPARAM_out", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_block1_mixer_REPARAM_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack2_block1_mixer_REPARAM_1_pad", "inbound_nodes": [[["stack2_downsample_2_outgelu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_block1_mixer_REPARAM_1_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_block1_mixer_REPARAM_1_dw_conv", "inbound_nodes": [[["stack2_block1_mixer_REPARAM_1_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_block1_mixer_REPARAM_2_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_block1_mixer_REPARAM_2_dw_conv", "inbound_nodes": [[["stack2_downsample_2_outgelu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block1_mixer_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block1_mixer_REPARAM_1_bn", "inbound_nodes": [[["stack2_block1_mixer_REPARAM_1_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block1_mixer_REPARAM_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block1_mixer_REPARAM_2_bn", "inbound_nodes": [[["stack2_block1_mixer_REPARAM_2_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block1_mixer_REPARAM_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block1_mixer_REPARAM_0_bn", "inbound_nodes": [[["stack2_downsample_2_outgelu", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_block1_mixer_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stack2_block1_mixer_REPARAM_out", "inbound_nodes": [[["stack2_block1_mixer_REPARAM_1_bn", 0, 0, {}], ["stack2_block1_mixer_REPARAM_2_bn", 0, 0, {}], ["stack2_block1_mixer_REPARAM_0_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block1_mixer_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block1_mixer_bn", "inbound_nodes": [[["stack2_downsample_2_outgelu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_2", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_2", "inbound_nodes": [["stack2_block1_mixer_REPARAM_out", 0, 0, {"y": ["stack2_block1_mixer_bn", 0, 0], "name": null}]]}, {"class_name": "resmlp>ChannelAffine", "config": {"name": "stack2_block1_1_gamma", "trainable": true, "dtype": "float32", "use_bias": false, "weight_init_value": 1e-05, "axis": -1}, "name": "stack2_block1_1_gamma", "inbound_nodes": [[["tf.math.subtract_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_block1_1_output", "trainable": true, "dtype": "float32"}, "name": "stack2_block1_1_output", "inbound_nodes": [[["stack2_downsample_2_outgelu", 0, 0, {}], ["stack2_block1_1_gamma", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_block1_mlp_pre_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "stack2_block1_mlp_pre_pad", "inbound_nodes": [[["stack2_block1_1_output", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_block1_mlp_pre_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_block1_mlp_pre_conv", "inbound_nodes": [[["stack2_block1_mlp_pre_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block1_mlp_pre_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block1_mlp_pre_bn", "inbound_nodes": [[["stack2_block1_mlp_pre_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_block1_mlp_Conv_0", "trainable": true, "dtype": "float32", "filters": 288, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_block1_mlp_Conv_0", "inbound_nodes": [[["stack2_block1_mlp_pre_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack2_block1_mlp_gelu", "trainable": true, "dtype": "float32", "activation": "gelu"}, "name": "stack2_block1_mlp_gelu", "inbound_nodes": [[["stack2_block1_mlp_Conv_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_block1_mlp_Conv_1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_block1_mlp_Conv_1", "inbound_nodes": [[["stack2_block1_mlp_gelu", 0, 0, {}]]]}, {"class_name": "resmlp>ChannelAffine", "config": {"name": "stack2_block1_2_gamma", "trainable": true, "dtype": "float32", "use_bias": false, "weight_init_value": 1e-05, "axis": -1}, "name": "stack2_block1_2_gamma", "inbound_nodes": [[["stack2_block1_mlp_Conv_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_block1_2_output", "trainable": true, "dtype": "float32"}, "name": "stack2_block1_2_output", "inbound_nodes": [[["stack2_block1_1_output", 0, 0, {}], ["stack2_block1_2_gamma", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_block2_mixer_REPARAM_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack2_block2_mixer_REPARAM_1_pad", "inbound_nodes": [[["stack2_block1_2_output", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_block2_mixer_REPARAM_1_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_block2_mixer_REPARAM_1_dw_conv", "inbound_nodes": [[["stack2_block2_mixer_REPARAM_1_pad", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_block2_mixer_REPARAM_2_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_block2_mixer_REPARAM_2_dw_conv", "inbound_nodes": [[["stack2_block1_2_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block2_mixer_REPARAM_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block2_mixer_REPARAM_1_bn", "inbound_nodes": [[["stack2_block2_mixer_REPARAM_1_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block2_mixer_REPARAM_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block2_mixer_REPARAM_2_bn", "inbound_nodes": [[["stack2_block2_mixer_REPARAM_2_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block2_mixer_REPARAM_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block2_mixer_REPARAM_0_bn", "inbound_nodes": [[["stack2_block1_2_output", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_block2_mixer_REPARAM_out", "trainable": true, "dtype": "float32"}, "name": "stack2_block2_mixer_REPARAM_out", "inbound_nodes": [[["stack2_block2_mixer_REPARAM_1_bn", 0, 0, {}], ["stack2_block2_mixer_REPARAM_2_bn", 0, 0, {}], ["stack2_block2_mixer_REPARAM_0_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_block2_mixer_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_block2_mixer_bn", "inbound_nodes": [[["stack2_block1_2_output", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_3", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_3", "inbound_nodes": [["stack2_block2_mixer_REPARAM_out", 0, 0, {"y": ["stack2_block2_mixer_bn", 0, 0], "name": null}]]}, {"class_name": "resmlp>ChannelAffine", "config": {"name": "stack2_block2_1_gamma", "trainable": true, "dtype": "float32", "use_bias": false, "weight_init_value": 1e-05, "axis": -1}, "name": "stack2_block2_1_gamma", "inbound_nodes": [[["tf.math.subtract_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_block2_1_output", "trainable": true, "dtype": "float32"}, "name": "stack2_block2_1_output", "inbound_nodes": [[["stack2_block1_2_output", 0, 0, {}], ["stack2_block2_1_gamma", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_block2_mlp_pre_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "stack2_block2_mlp_pre_pad", "inbound_nodes": [[["stack2_block2_1_output", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_block2_mlp_pre_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, 