{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "ghostnet_050", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "stem_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stem_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv", "inbound_nodes": [[["stem_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stem_relu", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_ghost_1_prim_conv", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_ghost_1_prim_conv", "inbound_nodes": [[["stem_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_ghost_1_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_ghost_1_prim_bn", "inbound_nodes": [[["stack1_ghost_1_prim_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack1_ghost_1_prim_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack1_ghost_1_prim_relu", "inbound_nodes": [[["stack1_ghost_1_prim_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack1_ghost_1_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack1_ghost_1_cheap_dw_pad", "inbound_nodes": [[["stack1_ghost_1_prim_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack1_ghost_1_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack1_ghost_1_cheap_dw_conv", "inbound_nodes": [[["stack1_ghost_1_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_ghost_1_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_ghost_1_cheap_bn", "inbound_nodes": [[["stack1_ghost_1_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack1_ghost_1_cheap_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack1_ghost_1_cheap_relu", "inbound_nodes": [[["stack1_ghost_1_cheap_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["stack1_ghost_1_prim_relu", 0, 0, {}], ["stack1_ghost_1_cheap_relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack1_ghost_2_prim_conv", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack1_ghost_2_prim_conv", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_ghost_2_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_ghost_2_prim_bn", "inbound_nodes": [[["stack1_ghost_2_prim_conv", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack1_ghost_2_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack1_ghost_2_cheap_dw_pad", "inbound_nodes": [[["stack1_ghost_2_prim_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack1_ghost_2_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack1_ghost_2_cheap_dw_conv", "inbound_nodes": [[["stack1_ghost_2_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack1_ghost_2_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack1_ghost_2_cheap_bn", "inbound_nodes": [[["stack1_ghost_2_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["stack1_ghost_2_prim_bn", 0, 0, {}], ["stack1_ghost_2_cheap_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack1_output", "trainable": true, "dtype": "float32"}, "name": "stack1_output", "inbound_nodes": [[["stem_relu", 0, 0, {}], ["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_ghost_1_prim_conv", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_ghost_1_prim_conv", "inbound_nodes": [[["stack1_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_ghost_1_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_ghost_1_prim_bn", "inbound_nodes": [[["stack2_ghost_1_prim_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack2_ghost_1_prim_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack2_ghost_1_prim_relu", "inbound_nodes": [[["stack2_ghost_1_prim_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_ghost_1_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack2_ghost_1_cheap_dw_pad", "inbound_nodes": [[["stack2_ghost_1_prim_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_ghost_1_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_ghost_1_cheap_dw_conv", "inbound_nodes": [[["stack2_ghost_1_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_ghost_1_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_ghost_1_cheap_bn", "inbound_nodes": [[["stack2_ghost_1_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack2_ghost_1_cheap_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack2_ghost_1_cheap_relu", "inbound_nodes": [[["stack2_ghost_1_cheap_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["stack2_ghost_1_prim_relu", 0, 0, {}], ["stack2_ghost_1_cheap_relu", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_down_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack2_down_dw_pad", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_down_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_down_dw_conv", "inbound_nodes": [[["stack2_down_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_down_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_down_bn", "inbound_nodes": [[["stack2_down_dw_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_ghost_2_prim_conv", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_ghost_2_prim_conv", "inbound_nodes": [[["stack2_down_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_short_1_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack2_short_1_dw_pad", "inbound_nodes": [[["stack1_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_ghost_2_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_ghost_2_prim_bn", "inbound_nodes": [[["stack2_ghost_2_prim_conv", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_short_1_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_short_1_dw_conv", "inbound_nodes": [[["stack2_short_1_dw_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack2_ghost_2_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack2_ghost_2_cheap_dw_pad", "inbound_nodes": [[["stack2_ghost_2_prim_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_short_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_short_1_bn", "inbound_nodes": [[["stack2_short_1_dw_conv", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack2_ghost_2_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack2_ghost_2_cheap_dw_conv", "inbound_nodes": [[["stack2_ghost_2_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack2_short_2_conv", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack2_short_2_conv", "inbound_nodes": [[["stack2_short_1_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_ghost_2_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_ghost_2_cheap_bn", "inbound_nodes": [[["stack2_ghost_2_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack2_short_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack2_short_2_bn", "inbound_nodes": [[["stack2_short_2_conv", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_3", "inbound_nodes": [[["stack2_ghost_2_prim_bn", 0, 0, {}], ["stack2_ghost_2_cheap_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack2_output", "trainable": true, "dtype": "float32"}, "name": "stack2_output", "inbound_nodes": [[["stack2_short_2_bn", 0, 0, {}], ["concatenate_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack3_ghost_1_prim_conv", "trainable": true, "dtype": "float32", "filters": 18, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack3_ghost_1_prim_conv", "inbound_nodes": [[["stack2_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack3_ghost_1_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack3_ghost_1_prim_bn", "inbound_nodes": [[["stack3_ghost_1_prim_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack3_ghost_1_prim_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack3_ghost_1_prim_relu", "inbound_nodes": [[["stack3_ghost_1_prim_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack3_ghost_1_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack3_ghost_1_cheap_dw_pad", "inbound_nodes": [[["stack3_ghost_1_prim_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack3_ghost_1_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack3_ghost_1_cheap_dw_conv", "inbound_nodes": [[["stack3_ghost_1_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack3_ghost_1_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack3_ghost_1_cheap_bn", "inbound_nodes": [[["stack3_ghost_1_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack3_ghost_1_cheap_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack3_ghost_1_cheap_relu", "inbound_nodes": [[["stack3_ghost_1_cheap_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_4", "inbound_nodes": [[["stack3_ghost_1_prim_relu", 0, 0, {}], ["stack3_ghost_1_cheap_relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack3_ghost_2_prim_conv", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack3_ghost_2_prim_conv", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack3_ghost_2_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack3_ghost_2_prim_bn", "inbound_nodes": [[["stack3_ghost_2_prim_conv", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack3_ghost_2_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack3_ghost_2_cheap_dw_pad", "inbound_nodes": [[["stack3_ghost_2_prim_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack3_ghost_2_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack3_ghost_2_cheap_dw_conv", "inbound_nodes": [[["stack3_ghost_2_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack3_ghost_2_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack3_ghost_2_cheap_bn", "inbound_nodes": [[["stack3_ghost_2_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_5", "inbound_nodes": [[["stack3_ghost_2_prim_bn", 0, 0, {}], ["stack3_ghost_2_cheap_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack3_output", "trainable": true, "dtype": "float32"}, "name": "stack3_output", "inbound_nodes": [[["stack2_output", 0, 0, {}], ["concatenate_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack4_ghost_1_prim_conv", "trainable": true, "dtype": "float32", "filters": 18, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack4_ghost_1_prim_conv", "inbound_nodes": [[["stack3_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack4_ghost_1_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack4_ghost_1_prim_bn", "inbound_nodes": [[["stack4_ghost_1_prim_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack4_ghost_1_prim_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack4_ghost_1_prim_relu", "inbound_nodes": [[["stack4_ghost_1_prim_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack4_ghost_1_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack4_ghost_1_cheap_dw_pad", "inbound_nodes": [[["stack4_ghost_1_prim_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack4_ghost_1_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack4_ghost_1_cheap_dw_conv", "inbound_nodes": [[["stack4_ghost_1_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack4_ghost_1_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack4_ghost_1_cheap_bn", "inbound_nodes": [[["stack4_ghost_1_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack4_ghost_1_cheap_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack4_ghost_1_cheap_relu", "inbound_nodes": [[["stack4_ghost_1_cheap_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_6", "inbound_nodes": [[["stack4_ghost_1_prim_relu", 0, 0, {}], ["stack4_ghost_1_cheap_relu", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack4_down_dw_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "stack4_down_dw_pad", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack4_down_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack4_down_dw_conv", "inbound_nodes": [[["stack4_down_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack4_down_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack4_down_bn", "inbound_nodes": [[["stack4_down_dw_conv", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean", "inbound_nodes": [["stack4_down_bn", 0, 0, {"axis": [1, 2], "keepdims": true}]]}, {"class_name": "Conv2D", "config": {"name": "stack4_se_1_conv", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack4_se_1_conv", "inbound_nodes": [[["tf.math.reduce_mean", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack4_se_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack4_se_relu", "inbound_nodes": [[["stack4_se_1_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack4_se_2_conv", "trainable": true, "dtype": "float32", "filters": 36, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack4_se_2_conv", "inbound_nodes": [[["stack4_se_relu", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack4_se_hard_sigmoid_torch", "trainable": true, "dtype": "float32", "activation": "kecamCommon>hard_sigmoid_torch"}, "name": "stack4_se_hard_sigmoid_torch", "inbound_nodes": [[["stack4_se_2_conv", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "stack4_se_out", "trainable": true, "dtype": "float32"}, "name": "stack4_se_out", "inbound_nodes": [[["stack4_down_bn", 0, 0, {}], ["stack4_se_hard_sigmoid_torch", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack4_ghost_2_prim_conv", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack4_ghost_2_prim_conv", "inbound_nodes": [[["stack4_se_out", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack4_short_1_dw_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "stack4_short_1_dw_pad", "inbound_nodes": [[["stack3_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack4_ghost_2_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack4_ghost_2_prim_bn", "inbound_nodes": [[["stack4_ghost_2_prim_conv", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack4_short_1_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack4_short_1_dw_conv", "inbound_nodes": [[["stack4_short_1_dw_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack4_ghost_2_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack4_ghost_2_cheap_dw_pad", "inbound_nodes": [[["stack4_ghost_2_prim_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack4_short_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack4_short_1_bn", "inbound_nodes": [[["stack4_short_1_dw_conv", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack4_ghost_2_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack4_ghost_2_cheap_dw_conv", "inbound_nodes": [[["stack4_ghost_2_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack4_short_2_conv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack4_short_2_conv", "inbound_nodes": [[["stack4_short_1_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack4_ghost_2_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack4_ghost_2_cheap_bn", "inbound_nodes": [[["stack4_ghost_2_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack4_short_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack4_short_2_bn", "inbound_nodes": [[["stack4_short_2_conv", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_7", "inbound_nodes": [[["stack4_ghost_2_prim_bn", 0, 0, {}], ["stack4_ghost_2_cheap_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stack4_output", "trainable": true, "dtype": "float32"}, "name": "stack4_output", "inbound_nodes": [[["stack4_short_2_bn", 0, 0, {}], ["concatenate_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack5_ghost_1_prim_conv", "trainable": true, "dtype": "float32", "filters": 30, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack5_ghost_1_prim_conv", "inbound_nodes": [[["stack4_output", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack5_ghost_1_prim_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack5_ghost_1_prim_bn", "inbound_nodes": [[["stack5_ghost_1_prim_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack5_ghost_1_prim_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack5_ghost_1_prim_relu", "inbound_nodes": [[["stack5_ghost_1_prim_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "stack5_ghost_1_cheap_dw_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "stack5_ghost_1_cheap_dw_pad", "inbound_nodes": [[["stack5_ghost_1_prim_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "stack5_ghost_1_cheap_dw_conv", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "stack5_ghost_1_cheap_dw_conv", "inbound_nodes": [[["stack5_ghost_1_cheap_dw_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stack5_ghost_1_cheap_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stack5_ghost_1_cheap_bn", "inbound_nodes": [[["stack5_ghost_1_cheap_dw_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack5_ghost_1_cheap_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack5_ghost_1_cheap_relu", "inbound_nodes": [[["stack5_ghost_1_cheap_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_8", "inbound_nodes": [[["stack5_ghost_1_prim_relu", 0, 0, {}], ["stack5_ghost_1_cheap_relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_1", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_1", "inbound_nodes": [["concatenate_8", 0, 0, {"axis": [1, 2], "keepdims": true}]]}, {"class_name": "Conv2D", "config": {"name": "stack5_se_1_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack5_se_1_conv", "inbound_nodes": [[["tf.math.reduce_mean_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack5_se_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stack5_se_relu", "inbound_nodes": [[["stack5_se_1_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack5_se_2_conv", "trainable": true, "dtype": "float32", "filters": 60, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack5_se_2_conv", "inbound_nodes": [[["stack5_se_relu", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stack5_se_hard_sigmoid_torch", "trainable": true, "dtype": "float32", "activation": "kecamCommon>hard_sigmoid_torch"}, "name": "stack5_se_hard_sigmoid_torch", "inbound_nodes": [[["stack5_se_2_conv", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "stack5_se_out", "trainable": true, "dtype": "float32"}, "name": "stack5_se_out", "inbound_nodes": [[["concatenate_8", 0, 0, {}], ["stack5_se_hard_sigmoid_torch", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stack5_ghost_2_prim_conv", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stack5_ghost_2_prim_conv", "inbound_nodes": [[["stack5_se_out", 0, 0, {}]]]}, {"class_name": 